# GetSolidPatternId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinePatternElement..::..GetSolidPatternId Method
LinePatternElement Class See Also
---
Gets the solid line pattern element id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static ElementId GetSolidPatternId()
```

Visual Basic
---
```text
Public Shared Function GetSolidPatternId As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetSolidPatternId()
```

# ### Return Value
The element id of the solid line pattern.
# Remarks
Note that Solid is special. It isn't a line pattern at all -- it is a special code that tells drawing and export code to use solid lines rather than patterned lines. Solid is visible to the user when selecting line patterns.
# See Also
LinePatternElement Class
Autodesk.Revit.DB Namespace